In [4]:
import pandas as pd #import the pandas and aliasing as pd
import numpy as np
data = np.array(['a','b','c','d'])
s1 = pd.Series(data)
print(s1)
data = np.array([1,2,3,4])
s2 = pd.Series(data)
print(s2)

0    a
1    b
2    c
3    d
dtype: object
0    1
1    2
2    3
3    4
dtype: int32

In [6]:
data = np.array(['a','b','c','d'])
s = pd.Series(data,index=[100,101,102,103])
print(s)

100    a
101    b
102    c
103    d
dtype: object

### exercise

In [20]:
s = pd.Series([1,2,3,4,5],index = ['a','b','c','d','e'])
print(s[[0,1,2]])

a    1
b    2
c    3
dtype: int64

In [21]:
print(s[['a','b','c']])

a    1
b    2
c    3
dtype: int64

In [39]:
import pandas as pd
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [40]:
data = [1,2,3,4,5]
df1 = pd.DataFrame(data)
print(df1)

   0
0  1
1  2
2  3
3  4
4  5

In [41]:
data = [['Alex',10],['Bob',12],['Clarke',13]]
df2 = pd.DataFrame(data,columns=['Name','Age'])
print(df2)

     Name  Age
0    Alex   10
1     Bob   12
2  Clarke   13

In [42]:
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29,42]}
df = pd.DataFrame(data)
print(df)

    Name  Age
0    Tom   28
1   Jack   34
2  Steve   29
3  Ricky   42

In [43]:
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
     'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}
df = pd.DataFrame(d)
print(df)

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

### exercise

In [70]:
studentDF={'Math':pd.Series([90,10,34,23,43]),'C_Programming':pd.Series([70,20,25,32,73]),
      'Java':pd.Series([50,41,67,34,23]),'Web_programming':pd.Series([55,66,23,76,67])}
studentDF=pd.DataFrame(studentDF)
print(studentDF)

   Math  C_Programming  Java  Web_programming
0    90             70    50               55
1    10             20    41               66
2    34             25    67               23
3    23             32    34               76
4    43             73    23               67

In [71]:
print(studentDF[2:4]) #Slice Rows
print(studentDF.loc[0])
print(studentDF.loc[2])
print(studentDF.loc[0:2])

   Math  C_Programming  Java  Web_programming
2    34             25    67               23
3    23             32    34               76
Math               90
C_Programming      70
Java               50
Web_programming    55
Name: 0, dtype: int64
Math               34
C_Programming      25
Java               67
Web_programming    23
Name: 2, dtype: int64
   Math  C_Programming  Java  Web_programming
0    90             70    50               55
1    10             20    41               66
2    34             25    67               23

In [72]:
df = pd.DataFrame([[1, 2], [3, 4]], columns = ['a','b'])
df2 = pd.DataFrame([[5, 6], [7, 8]], columns = ['a','b'])
df = df.append(df2)
print(df)

   a  b
0  1  2
1  3  4
0  5  6
1  7  8

In [73]:
studentDF2={'Math':pd.Series([59,41],index=[5,6]),'C_Programming':pd.Series([37,34],index=[5,6]),
      'Java':pd.Series([84,73],index=[5,6]),'Web_programming':pd.Series([82,55],index=[5,6])}
studentDF2=pd.DataFrame(studentDF2)
studentDF=studentDF.append(studentDF2)
print(studentDF)

   Math  C_Programming  Java  Web_programming
0    90             70    50               55
1    10             20    41               66
2    34             25    67               23
3    23             32    34               76
4    43             73    23               67
5    59             37    84               82
6    41             34    73               55

In [74]:
# Drop rows with label 0
df = df.drop(0)
print(df)

   a  b
1  3  4
1  7  8

### exercise

In [75]:
studentDF=studentDF.drop(6)
print(studentDF)

   Math  C_Programming  Java  Web_programming
0    90             70    50               55
1    10             20    41               66
2    34             25    67               23
3    23             32    34               76
4    43             73    23               67
5    59             37    84               82

### ----------------Milestone 1-------------------

In [78]:
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29,42]}
df = pd.DataFrame(data)
df.sum()

Name    TomJackSteveRicky
Age                   133
dtype: object

### exercise

In [79]:
studentDF.sum()

Math               259
C_Programming      257
Java               299
Web_programming    369
dtype: int64

In [81]:
studentDF.sum(axis=1)

0    265
1    137
2    149
3    165
4    206
5    262
dtype: int64

In [82]:
studentDF.count()
studentDF.mean()
studentDF.median()
studentDF.mode()
studentDF.std()
studentDF.min()
studentDF.max()
studentDF.abs()
studentDF.prod()
studentDF.cumsum()
studentDF.cumprod()

         Math  C_Programming        Java  Web_programming
0          90             70          50               55
1         900           1400        2050             3630
2       30600          35000      137350            83490
3      703800        1120000     4669900          6345240
4    30263400       81760000   107407700        425131080
5  1785540600     3025120000  9022246800      34860748560

In [83]:
import pandas as pd
import numpy as np
#Create a Dictionary of series
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack','Lee','David','Gasper',
                       'Betina','Andres']),'Age':pd.Series([25,26,25,23,30,29,23,34,40,30,51,46]),
     'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8,3.78,2.98,4.80,4.10,3.65])}
#Create a DataFrame
df = pd.DataFrame(d)
df.describe()

             Age     Rating
count  12.000000  12.000000
mean   31.833333   3.743333
std     9.232682   0.661628
min    23.000000   2.560000
25%    25.000000   3.230000
50%    29.500000   3.790000
75%    35.500000   4.132500
max    51.000000   4.800000

In [84]:
studentDF.describe()

            Math  C_Programming       Java  Web_programming
count   6.000000       6.000000   6.000000         6.000000
mean   43.166667      42.833333  49.833333        61.500000
std    28.407159      22.973173  22.409076        21.002381
min    10.000000      20.000000  23.000000        23.000000
25%    25.750000      26.750000  35.750000        57.750000
50%    38.500000      34.500000  45.500000        66.500000
75%    55.000000      61.750000  62.750000        73.750000
max    90.000000      73.000000  84.000000        82.000000

In [85]:
studentDF = studentDF.reindex([0,1,2,3,4,5,6,7])
print(studentDF)

   Math  C_Programming  Java  Web_programming
0  90.0           70.0  50.0             55.0
1  10.0           20.0  41.0             66.0
2  34.0           25.0  67.0             23.0
3  23.0           32.0  34.0             76.0
4  43.0           73.0  23.0             67.0
5  59.0           37.0  84.0             82.0
6   NaN            NaN   NaN              NaN
7   NaN            NaN   NaN              NaN

In [86]:
df = pd.DataFrame(np.random.randn(5, 3), index=['a','c','e','f','h'],columns=['one','two','three'])
df = df.reindex(['a','b','c','d','e','f','g','h'])
print(df['one'].isnull())
print(df['two'].notnull())

a    False
b     True
c    False
d     True
e    False
f    False
g     True
h    False
Name: one, dtype: bool
a     True
b    False
c     True
d    False
e     True
f     True
g    False
h     True
Name: two, dtype: bool

### exercise

In [87]:
print(studentDF.isnull())
print(studentDF.notnull())

    Math  C_Programming   Java  Web_programming
0  False          False  False            False
1  False          False  False            False
2  False          False  False            False
3  False          False  False            False
4  False          False  False            False
5  False          False  False            False
6   True           True   True             True
7   True           True   True             True
    Math  C_Programming   Java  Web_programming
0   True           True   True             True
1   True           True   True             True
2   True           True   True             True
3   True           True   True             True
4   True           True   True             True
5   True           True   True             True
6  False          False  False            False
7  False          False  False            False

In [89]:
s1 = studentDF
s2 = studentDF
s1 = s1.fillna(0)
s2 = s2.fillna(method='pad')
print(s1)
print(s2)

   Math  C_Programming  Java  Web_programming
0  90.0           70.0  50.0             55.0
1  10.0           20.0  41.0             66.0
2  34.0           25.0  67.0             23.0
3  23.0           32.0  34.0             76.0
4  43.0           73.0  23.0             67.0
5  59.0           37.0  84.0             82.0
6   0.0            0.0   0.0              0.0
7   0.0            0.0   0.0              0.0
   Math  C_Programming  Java  Web_programming
0  90.0           70.0  50.0             55.0
1  10.0           20.0  41.0             66.0
2  34.0           25.0  67.0             23.0
3  23.0           32.0  34.0             76.0
4  43.0           73.0  23.0             67.0
5  59.0           37.0  84.0             82.0
6  59.0           37.0  84.0             82.0
7  59.0           37.0  84.0             82.0

### ------------------------------Milestone 2-------------------------------------

In [90]:
left = pd.DataFrame({'id':[1,2,3,4,5],'Name': ['Alex','Amy','Allen','Alice','Ayoung'],
                     'subject_id':['sub1','sub2','sub4','sub6','sub5']})
right = pd.DataFrame({'id':[1,2,3,4,5],'subject_name':['Math','English','Social Science',
                                                       'Programming','Physics']})
print(left)
print(right)

   id    Name subject_id
0   1    Alex       sub1
1   2     Amy       sub2
2   3   Allen       sub4
3   4   Alice       sub6
4   5  Ayoung       sub5
   id    subject_name
0   1            Math
1   2         English
2   3  Social Science
3   4     Programming
4   5         Physics

In [93]:
merged_table = pd.merge(left,right,on='id')
print(merged_table)

   id    Name subject_id    subject_name
0   1    Alex       sub1            Math
1   2     Amy       sub2         English
2   3   Allen       sub4  Social Science
3   4   Alice       sub6     Programming
4   5  Ayoung       sub5         Physics

### exercise

In [97]:
section=pd.DataFrame({'id':[0,1,2,3,4,5],'section':['one','one','one','two','two','two']})
student=pd.DataFrame({'id':[0,1,2,3,4,5],'name':['Mat','Mike','John','Peecha','Prabu','Bunchu'],
                     'math':[34,12,34,12,65,23],'english':[23,13,51,62,12,42]})
score=pd.merge(section,student,on='id')
print(score)

   id section    name  math  english
0   0     one     Mat    34       23
1   1     one    Mike    12       13
2   2     one    John    34       51
3   3     two  Peecha    12       62
4   4     two   Prabu    65       12
5   5     two  Bunchu    23       42

In [98]:
score_sec = score.groupby('section')
score_sec.sum()

         id  math  english
section
one       3    80       87
two      12   100      116

### --------------------------Milestone 3-------------------------------